/* ------------------------------------------------------------------------- */
///
/// IReadOnlyPermission.cs
///
/// Copyright (c) 2013 CubeSoft, Inc. All rights reserved.
///
/// This program is free software: you can redistribute it and/or modify
/// it under the terms of the GNU General Public License as published by
/// the Free Software Foundation, either version 3 of the License, or
/// (at your option) any later version.
///
/// This program is distributed in the hope that it will be useful,
/// but WITHOUT ANY WARRANTY; without even the implied warranty of
/// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
/// GNU General Public License for more details.
///
/// You should have received a copy of the GNU General Public License
/// along with this program.  If not, see < http://www.gnu.org/licenses/ >.
///
/* ------------------------------------------------------------------------- */
using System;

namespace CubePdf.Data
{
    /* --------------------------------------------------------------------- */
    ///
    /// Permission
    /// 
    /// <summary>
    /// 暗号化されている PDF ファイルで許可されている権限に関する情報を
    /// 読み取り専用で提供するためのインターフェースです。
    /// </summary>
    ///
    /* --------------------------------------------------------------------- */
    public interface IReadOnlyPermission
    {
        /* ----------------------------------------------------------------- */
        ///
        /// Printing
        ///
        /// <summary>
        /// 印刷操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool Printing { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// DegradedPrinting
        /// 
        /// <summary>
        /// 低品質での印刷操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool DegradedPrinting { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// Assembly
        /// 
        /// <summary>
        /// 文書アセンブリ（ページの挿入・削除・回転、しおりとサムネイルの
        /// 作成）操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool Assembly { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// ModifyContents
        /// 
        /// <summary>
        /// 内容の編集操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool ModifyContents { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// CopyContents
        /// 
        /// <summary>
        /// 内容の選択/コピー操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool CopyContents { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// Accessibility
        /// 
        /// <summary>
        /// アクセシビリティ（視覚に障害を持つユーザに対して、読み上げ機能
        /// を提供する）のための内容の抽出操作が許可されているかどうかを
        /// 取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool Accessibility { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// ExtractPage
        /// 
        /// <summary>
        /// ページの抽出操作が許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool ExtractPage { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// ModifyAnnotations
        /// 
        /// <summary>
        /// 注釈の追加・編集操作が許可されているかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool ModifyAnnotations { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// InputFormFields
        /// 
        /// <summary>
        /// フォームフィールドへの入力操作が許可されているかどうかを取得
        /// します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool InputFormFields { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// Signature
        /// 
        /// <summary>
        /// 既存の署名フィールドへの署名が許可されているかどうかを取得
        /// します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool Signature { get; }

        /* ----------------------------------------------------------------- */
        ///
        /// TemplatePage
        /// 
        /// <summary>
        /// コンテンツの動的な作成等に利用するテンプレートページの作成が
        /// 許可されているかどうかを取得します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        bool TemplatePage { get; }
    }
}
